Fix author name to Nik. Kontopoulos
